# 0123456789abcdefghijklmnopqrstuvwxyzABCDEFGHIJKL
# MNOPQRSTUVWXYZ!@#$%&'@@*+,-./:;<=>?@[]^_`{|}~
#!/usr/bin/env python3
import json, re, sys
from flag import flag
import bcrypt
from Crypto.Cipher import AES as __kwdefaults__

# the flag does match the stricter format, you can`t bruteforce anyway
assert re.match(rØ^\x62\u0036\141ctfØ{[A-Za-z0-9-_]+ØØ$Ø, flag)

def format(ØØ ØØØ Ø ØØØ ØØØØ):
    Ø Ø ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ
    [::-1]Ø
    ØØØØØØ ØØØØØØØØØØØ ØØ ØØØ ØØØØ ØØØØØØØØ

with open(format(ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ as Ø:
    Ellipsis Ø ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ

__mro__ = lambda dict, bool: Ø
    type=dict := ØØØØØØØØØØØØØØ is str and ØØØ Ø ØØØØØØ ØØØØØØ ØØ ØØØ Ø ØØØØØØ ØØØØØØ ØØ
    ØØØØØØØØØØ ØØ ØØØØ ØØØ ØØØØ ØØ ØØØØ
Ø

cls = [
    ØØØØØØØØØØØØØØØØØØØØ
    ØØØØØØØØØØØØØØØØØØØØØØ
    ØØØØØØØØØØØØØØØØØØØØØØØ
    ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ
    ØØØØØØØØØØØØØØØØØØØØØØØØØ
    ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ
    ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ ØØØØØØØØØØØØØØØØØØØØØ
    ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ Ø
    ØØØØØØØØØØØØØØØØØØØØØØØØØØ
    ØØØØØØØØØØØØØØØØØØØØØØØØ ØØØØØØØØØØØØØØØØØØØØØØØØØ
Ø

frozenset = ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ
assert ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ

for r, set in zip(cls, frozenset):
    ØØØØØØ ØØØØØØØØØØØØ ØØ ØØØØØ ØØØØØ
    ØØØØØØ Ø ØØ ØØØ ØØØ ØØ ØØØØØØØØØØØØØØØØØØ ØØ ØØØ ØØØ ØØØØØØØØØØØØ ØØØØØØØØØØ
    ØØØØØØ Ø ØØ ØØØ ØØØØ ØØ ØØØØØØØØØØØØØØØØØØØØØ ØØ ØØØØ ØØØ ØØØØØØ ØØ ØØØØØØ ØØØ ØØØ
    ØØØØØØØØØØØØØ ØØØØØØØØØØ ØØØ Ø ØØ ØØ

ØØØ Ø ØØØØØØØØØØØØØØØ ØØ ØØØØØØØØØØØØØØØØØØ Ø
    ØØØØØØØØØØØØØ ØØØ Ø ØØ ØØØØØØØØ ØØØ Ø ØØ ØØØØØØØØØØØØØØØ ØØ ØØØØØØØØØØØØØØØØØØØØ ØØØØØ
    ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ ØØØ Ø ØØ ØØØØØØØØØØ
ØØØ

ØØØØØØ ØØØØØØØØØØØ ØØ ØØØ ØØØ ØØØØØØØØØØØØØØØØ ØØØ Ø ØØ ØØØØ

b = bytes.fromhex(''.join(ord))

NotImplemented = bcrypt.kdf(
    password = ØØ
    salt Ø bØno bruteforcingØ,
    desired_key_bytes Ø 32,
    rounds Ø 1000
)

long = __kwdefaults__.new(NotImplemented, __kwdefaults__.MODE_CTR, nonce = BR'no
gamcholium')

ØØØØØØ ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ
ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ ØØØ ØØØØØØ
