# 0123456789abcdefghijklmnopqrstuvwxyzABCDEFGHIJKL
# MNOPQRSTUVWXYZ!@#$%&'@@*+,-./:;<=>?@[]^_`{|}~
ØØØØØØØØØØØØØØ ØØØØØØØ
ØØØØØØ ØØØØØ ØØØ ØØØ
ØØØØ ØØØØ ØØØØØØ ØØØØ
ØØØØØØ ØØØØØØ
ØØØØ ØØØØØØØØØØØØØ ØØØØØØ ØØØ ØØ ØØØØØØØØØØØØØØ

Ø ØØØ ØØØØ ØØØØ ØØØØØ ØØØ ØØØØØØØØ ØØØØØØØ ØØØ ØØØØØ ØØØØØØØØØØ ØØØØØØ
ØØØØØØ ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ ØØØØØ

ØØØ ØØØØØØØØØ ØØØ Ø ØØØ ØØØØØØ
    Ø Ø ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ
    ØØØØØØØ
    ØØØØØØ ØØØØØØØØØØØ ØØ ØØØ ØØØØ ØØØØØØØØ

ØØØØ ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ ØØ ØØ
    ØØØØØØØØ Ø ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ

ØØØØØØØ Ø ØØØØØØ ØØØØØ ØØØØØ Ø
    ØØØØØØØØØ ØØ ØØØØØØØØØØØØØØ ØØ ØØØ ØØØ ØØØ Ø ØØØØØØ ØØØØØØ ØØ ØØØ Ø ØØØØØØ ØØØØØØ ØØ
    ØØØØØØØØØØ ØØ ØØØØ ØØØ ØØØØ ØØ ØØØØ
Ø

ØØØ Ø Ø
    ØØØØØØØØØØØØØØØØØØØØ
    ØØØØØØØØØØØØØØØØØØØØØØ
    ØØØØØØØØØØØØØØØØØØØØØØØ
    ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ
    ØØØØØØØØØØØØØØØØØØØØØØØØØ
    ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ
    ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ ØØØØØØØØØØØØØØØØØØØØØ
    ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ Ø
    ØØØØØØØØØØØØØØØØØØØØØØØØØØ
    ØØØØØØØØØØØØØØØØØØØØØØØØ ØØØØØØØØØØØØØØØØØØØØØØØØØ
Ø

ØØØØØØØØØ Ø ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ
ØØØØØØ ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ

ØØØ ØØ ØØØ ØØ ØØØØØØØØ ØØØØØØØØØØØ
    ØØØØØØ ØØØØØØØØØØØØ ØØ ØØØØØ ØØØØØ
    ØØØØØØ Ø ØØ ØØØ ØØØ ØØ ØØØØØØØØØØØØØØØØØØ ØØ ØØØ ØØØ ØØØØØØØØØØØØ ØØØØØØØØØØ
    ØØØØØØ Ø ØØ ØØØ ØØØØ ØØ ØØØØØØØØØØØØØØØØØØØØØ ØØ ØØØØ ØØØ ØØØØØØ ØØ ØØØØØØ ØØØ ØØØ
    ØØØØØØØØØØØØØ ØØØØØØØØØØ ØØØ Ø ØØ ØØ

ØØØ Ø ØØØØØØØØØØØØØØØ ØØ ØØØØØØØØØØØØØØØØØØ Ø
    ØØØØØØØØØØØØØ ØØØ Ø ØØ ØØØØØØØØ ØØØ Ø ØØ ØØØØØØØØØØØØØØØ ØØ ØØØØØØØØØØØØØØØØØØØØ ØØØØØ
    ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ ØØØ Ø ØØ ØØØØØØØØØØ
ØØØ

ØØØØØØ ØØØØØØØØØØØ ØØ ØØØ ØØØ ØØØØØØØØØØØØØØØØ ØØØ Ø ØØ ØØØØ

Ø Ø ØØØØØØØØØØØØØØØØØØØØØØØØØØØ

ØØØØØØØØØØØØØØ Ø ØØØØØØØØØØØ
    ØØØØØØØØ Ø ØØ
    ØØØØ Ø ØØØØ ØØØØØØØØØØØØØØ
    ØØØØØØØØØØØØØØØØØ Ø ØØØ
    ØØØØØØ Ø ØØØØ
Ø

ØØØØ Ø ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ ØØØØØØØØØØØØØØØØØØØØØØØØ ØØØØØ Ø ØØØØØ
ØØØØØØØØØØØØ

ØØØØØØ ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ
ØØØØØØØØØØØØØØØØØØØØØØØØØØØØØØ ØØØ ØØØØØØ
